slovar = {'Генералитет', 'Дееспособный', 'Душевнобольной', 'Испепелить', 'Настроенный', 'Пассажир', 'Приспешник', 'Протоплазма', 'Распоясать', 'Тошнота', 'Единение', 'Клиника', 'Погибель', 'Полевод', 'Почиститься', 'Спроецировать', 'Формовщик', 'Великодушный', 'Комната'}
for i in slovar:
    print(len(i) * '*')
    slovo = i.split()
    slovo2 = i ###### ?
    slovo3 = i.split()
    slovo4 = ['*' * len(i)] ######
    break
x = input()
health = 15
while health:
    if x in slovo:
        slovo -= x
        slovo4[slovo2.find()] = x ######